
Функция ПолучитьКурсВалюты(текДата=Неопределено,текВалюта) Экспорт
	
	Валюта=Новый Структура("NumCode,CharCode,Nominal,Value");
	Если текДата=Неопределено тогда
		текДата=ТекущаяДата();
	КонецЕсли;
	Результат=0;
	//Сервер
	Сервер = "www.cbr.ru";
	
	//Курс всех валют на последнюю дату
	Адрес = "scripts/XML_daily.asp";
	НаДату="?date_req="+Формат(ТекДата,"ДФ=dd/MM/yyyy");
	
	//Курс всех валют определенную дату
	//Адрес = "scripts/XML_daily.asp?date_req=24/08/2016";
	
	//Курс Евро за период
	//Адрес = "scripts/XML_dynamic.asp?date_req1=20/08/2016&date_req2=24/08/2016&VAL_NM_RQ=R01239";	
	
	Попытка
		HTTP = Новый HTTPСоединение(Сервер);
	Исключение
		//Сообщить("Не удалось подключиться");
		Возврат Результат;
	КонецПопытки;
	
	Результат=1;
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес+НаДату); 
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Valute" Тогда
				Валюта.NumCode = Неопределено;
				Валюта.CharCode = Неопределено;
				Валюта.Nominal = Неопределено;
				Валюта.Value = Неопределено;
			Иначе
				текЭлем=ЧтениеXML.Имя;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если Валюта.Свойство(текЭлем) Тогда
				Валюта.Вставить(текЭлем, XMLЗначение(Тип("Строка"), ЧтениеXML.Значение));
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ЧтениеXML.Имя = "Valute" Тогда
				Если РаботаСВалютой.ПолучитьВалютуПоКоду(Валюта.NumCode)=текВалюта тогда
					РаботаСВалютой.УстановитьКурс(текДата,текВалюта,Валюта.Value,Валюта.Nominal);
					Результат=2;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьКурсыВалют(текДата=Неопределено) Экспорт
	
	Валюта=Новый Структура("NumCode,CharCode,Nominal,Value");
	Если текДата=Неопределено тогда
		текДата=ТекущаяДата();
	КонецЕсли;
	Результат=0;
	//Сервер
	Сервер = "www.cbr.ru";
	
	//Курс всех валют на последнюю дату
	Адрес = "scripts/XML_daily.asp";
	НаДату="?date_req="+Формат(ТекДата,"ДФ=dd/MM/yyyy");
	
	//Курс всех валют определенную дату
	//Адрес = "scripts/XML_daily.asp?date_req=24/08/2016";
	
	//Курс Евро за период
	//Адрес = "scripts/XML_dynamic.asp?date_req1=20/08/2016&date_req2=24/08/2016&VAL_NM_RQ=R01239";	
	
	Попытка
		HTTP = Новый HTTPСоединение(Сервер);
	Исключение
		//Сообщить("Не удалось подключиться");
		Возврат Результат;
	КонецПопытки;
	Результат=-1;
	HTTPЗапрос = Новый HTTPЗапрос(Адрес+НаДату); 
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Valute" Тогда
				Валюта.NumCode = Неопределено;
				Валюта.CharCode = Неопределено;
				Валюта.Nominal = Неопределено;
				Валюта.Value = Неопределено;
			Иначе
				текЭлем=ЧтениеXML.Имя;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если Валюта.Свойство(текЭлем) Тогда
				Валюта.Вставить(текЭлем, XMLЗначение(Тип("Строка"), ЧтениеXML.Значение));
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ЧтениеXML.Имя = "Valute" Тогда
				СсылкаВалюта=РаботаСВалютой.ПолучитьВалютуПоКоду(Валюта.NumCode);
				Если НЕ СсылкаВалюта.Пустая() тогда
					РаботаСВалютой.УстановитьКурс(текДата,СсылкаВалюта,Валюта.Value,Валюта.Nominal);
					Результат=1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	Возврат Результат;	
КонецФункции
