Процедура ОтправкаСтатистикиЕмайл() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КолВоДокументов
		|ИЗ
		|	Документ.Движения КАК Движения
		|ГДЕ
		|	Движения.Дата МЕЖДУ &ДатаН И &ДатаК";
	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(ТекущаяДата())-86400);
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(ТекущаяДата())-86400);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Попытка
		КолВоДокументов = Число(РезультатЗапроса[0].КолВоДокументов);
	Исключение
		КолВоДокументов = 0;
	КонецПопытки;
	//Отправить Емайл
	ПараметрыПочты = Новый Структура;
	ПараметрыПочты.Вставить("Кому","mayer@migservis.ru");
	Если КолВоДокументов > 0 тогда 
		ПараметрыПочты.Вставить("Тема",""""+Константы.ЗаголовокСистемы.Получить()+""" "+Формат(КолВоДокументов,"ЧН=Ноль")+" документов!");
		ПараметрыПочты.Вставить("Тело",""""+Константы.ЗаголовокСистемы.Получить()+""" "+Формат(КолВоДокументов,"ЧН=Ноль")+" документов!");
	Иначе
		ПараметрыПочты.Вставить("Тема","ВАЖНО """+Константы.ЗаголовокСистемы.Получить()+""" "+Формат(КолВоДокументов,"ЧН=Ноль")+" документов!");
		ПараметрыПочты.Вставить("Тело","ВАЖНО """+Константы.ЗаголовокСистемы.Получить()+""" "+Формат(КолВоДокументов,"ЧН=Ноль")+" документов!");
	КонецЕсли;
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПочты);
КонецПроцедуры