
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Подразделение", ПараметрыСеанса.ТекущийПользователь.Подразделение);
	//Запрос.Текст =      "ВЫБРАТЬ
	//                    |	Подразделения.Ссылка КАК Подразделение
	//                    |ИЗ
	//                    |	Справочник.Подразделения КАК Подразделения
	//                    |ГДЕ
	//                    |	Подразделения.Ссылка В ИЕРАРХИИ(&Подразделение)
	//                    |
	//                    |СГРУППИРОВАТЬ ПО
	//                    |	Подразделения.Ссылка";
	//Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");//.Выгрузить();
	//Список.Параметры.УстановитьЗначениеПараметра("Подразделения", Результат);
	//
	//
КонецПроцедуры
