
&НаСервере
Процедура ДобавитьГруппыНаСервере()
	Для каждого Стр из  ШаблоныГрупп цикл
		Если Стр.Выбор тогда
			Если Стр.Наименование = "Покупатели" тогда
				СоздатьГруппу("Покупатели", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,Справочники.РазделыОПиУ.ОбщиеПродажи,,ПланыСчетов.Внутренний.ЗадолженностьПокупателей,ПланыСчетов.Внутренний.АвансыПолученныеОтПокупателей);
			ИначеЕсли Стр.Наименование = "Поставщики" тогда
				СоздатьГруппу("Поставщики", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,,ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Сотрудники" тогда
				СоздатьГруппу("Сотрудники", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,,ПланыСчетов.Внутренний.АвансыВыданныеСотрудникам,ПланыСчетов.Внутренний.ЗадолженностьСотрудникам);
			ИначеЕсли Стр.Наименование = "Склады" тогда
				СоздатьГруппу("Склады", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.Себестоимость,ПланыСчетов.Внутренний.Запасы);
			ИначеЕсли Стр.Наименование = "Административные расходы" тогда
				СоздатьГруппу("Административные расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.АдминистративныеРасходы, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Коммерческие расходы" тогда
				СоздатьГруппу("Коммерческие расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.КоммерческиеМаркетинговыеРасходы, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Прочие доходы и расходы" тогда
				СоздатьГруппу("Прочие доходы и расходы", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.ПрочиеДоходыИРасходыВнереализационные, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			ИначеЕсли Стр.Наименование = "Налоги" тогда
				СоздатьГруппу("Налоги", Подразделение,Перечисления.РазделыДДС.ОперационнаяДеятельность,,Справочники.РазделыОПиУ.Налоги, ПланыСчетов.Внутренний.АвансыВыданныеПоставщикам,ПланыСчетов.Внутренний.ЗадолженностьПоставщикам);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппу(Название, Подразделение = неопределено, РазделДДС= неопределено, РазделОПиУДоход= неопределено, РазделОПиУРасход= неопределено, СчетУчетаДт= неопределено, СчетУчетаКт= неопределено)
	НоваяГруппа = Справочники.СтатьиДвижения.СоздатьГруппу();
	НоваяГруппа.Наименование = Название;
	НоваяГруппа.Подразделение = Подразделение;
	НоваяГруппа.РазделДДС = РазделДДС;
	НоваяГруппа.СчетУчетаКт = СчетУчетаКт;
	НоваяГруппа.СчетУчетаДт = СчетУчетаДт;
	НоваяГруппа.РазделОПиУДоход = РазделОПиУДоход;
	НоваяГруппа.РазделОПиУРасход = РазделОПиУРасход;
	НоваяГруппа.Валюта = Константы.ОсновнаяВалюта.Получить();
	НоваяГруппа.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппы(Команда)
	Если ПроверитьЗаполнение() тогда 
		ДобавитьГруппыНаСервере();
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполняем список значений шаблонов
	СписокЗн = новый СписокЗначений;
	СписокЗн.Добавить("Покупатели");
	СписокЗн.Добавить("Поставщики");
	СписокЗн.Добавить("Сотрудники");
	СписокЗн.Добавить("Склады");
	СписокЗн.Добавить("Административные расходы");
	СписокЗн.Добавить("Коммерческие расходы");
	СписокЗн.Добавить("Прочие доходы и расходы");
	СписокЗн.Добавить("Налоги");
	
	Для каждого Выбр из СписокЗн цикл
		Стр = ШаблоныГрупп.Добавить();
		Стр.Выбор = ложь;
		Стр.Наименование = Выбр.Значение;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		
		// Если он не заполнен, сообщим об этом пользователю
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указано Подразделение, для которого будут создаваться группы!";
		Сообщение.Поле = "Подразделение";
		Сообщение.Сообщить();
		
		// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Покупатель"
		
		//ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Подразделение"));
		// Так как информация не консистентна, то продолжать работу дальше смысла нет
		
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры
