#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Попытка
		ВнешниеИсточникиДанных.BalanceDB.dbo_Insert_fond(ЭтотОбъект.КодБаланс,ЭтотОбъект.Родитель.Родитель.КодБаланс,ЭтотОбъект.Родитель.КодБаланс,ЭтотОбъект.Подразделение.кодБаланс,"1",ЭтотОбъект.Наименование,ЭтотОбъект.Валюта.Наименование,"","1","",0);
	Исключение
		Сообщить(ОписаниеОшибки());
		//ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации
	КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли