
&НаКлиенте
Процедура СтатьяДвиженияВводОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.СтатьиДвижения.ФормаВыбора",,Элемент);
	Список = ФормаВыбора.Список;
    ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
    ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина );
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Истина );
    
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
	ГруппаОтбора.Использование = Истина; 
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
	ГруппаОтбора.Представление = "Отбор по подразделению";

    ОтборПоГруппе = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
    ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
    ОтборПоГруппе.ПравоеЗначение = НаборКонстант.ПодразделениеВводОстатков;
    ОтборПоГруппе = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
    ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборПоГруппе.ПравоеЗначение = РаботаСДаннымиСервер.ПустаяСсылкаСправочника("Подразделения");
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура МультивалютныйУчетПриИзменении(Элемент)
	//ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ЭтаФорма.ОбновитьОтображениеДанных();
	//ОбновитьИнтерфейс();
КонецПроцедуры
