
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	РезультатПолучения = ОбновитьКурс(ПараметрКоманды);
	Если РезультатПолучения=0 тогда
		ПоказатьПредупреждение(,"Не удалось подключиться к серверу ЦБ",30);
	ИначеЕсли РезультатПолучения=1 тогда
		ПоказатьПредупреждение(,"Для валюты отсутствует курс на сервере ЦБ",30);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьКурс(текВалюта)
	ПолучениеКурса=Обработки.ЗагрузкаКурсовВалютЦБ.Создать();
	Возврат ПолучениеКурса.ПолучитьКурсВалюты(ТекущаяДата(),текВалюта);
КонецФункции