&НаСервере
Функция ПолучитьСписок()
	текСписок=ТаблицаСостав.Выгрузить(,"Значение");
	Возврат текСписок.ВыгрузитьКолонку("Значение");
КонецФункции

&НаКлиенте
Процедура УстановитьОтбор(текСписок)
	Если текСписок.Количество() тогда
		СписокОтбора=Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(текСписок);
		ИсточникВыбора.Отбор.Элементы.Очистить();
		новОтбор=ИсточникВыбора.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		новОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке;
		новОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка");
		новОтбор.ПравоеЗначение=СписокОтбора;
		новОтбор.Использование=Истина;
	Иначе
		ИсточникВыбора.Отбор.Элементы.Очистить();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") тогда
		Объект.Пользователь=Параметры.Пользователь;
		ОбновитьСписки();
	КонецЕсли;
	
	МассивНастроек=РаботаСДаннымиСервер.СоставНастройкиПользователя();
	Для Каждого текПоле из МассивНастроек Цикл
		ДобавляемыеРеквизиты=Новый Массив;
		Реквизит = Новый РеквизитФормы("ЭлемНастр"+текПоле.Имя,текПоле.Тип,, текПоле.Заголовок, Истина);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		ЭлементФормы = ЭтаФорма.Элементы.Добавить("ЭлемНастр"+текПоле.Имя, Тип("ПолеФормы"), Элементы.ГруппаНастройкиНастройка);
		ЭлементФормы.ПутьКДанным = "ЭлемНастр"+текПоле.Имя; 
		ЭлементФормы.Вид         = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор(ПолучитьСписок());
	ОбновитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ОбновитьСписки();
	УстановитьОтбор(ПолучитьСписок());
	ОбновитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройки()
	МассивНастроек=УправлениеДоступомОформлением.НастройкиПользователя(Объект.Пользователь);
	Для Каждого текПоле из МассивНастроек Цикл
		этаформа["ЭлемНастр"+текПоле.Имя]=текПоле.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиДляСохранения()
	МассивНастроек=РаботаСДаннымиСервер.СоставНастройкиПользователя();
	Для Каждого текПоле из МассивНастроек Цикл
		Реквизит = Новый РеквизитФормы("ЭлемНастр"+текПоле.Имя,текПоле.Тип,, текПоле.Заголовок, Истина);
		текПоле.Вставить("Значение",этаформа["ЭлемНастр"+текПоле.Имя]);
	КонецЦикла;
	Возврат МассивНастроек;
КонецФункции

&НаСервере
Процедура ОбновитьСписки()
	ТаблицаСостав.Очистить();
	текСписок=УправлениеДоступомОформлением.ГруппыДОПользователя(Объект.Пользователь);
	Для Каждого текЭлем из текСписок Цикл
		НовСтрока=ТаблицаСостав.Добавить();
		НовСтрока.Значение=текЭлем.Значение;
		НовСтрока.ГруппаОформления=текЭлем.Пометка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементСписка(текЭлем)
	текСтроки=ТаблицаСостав.НайтиСтроки(Новый Структура("Значение",текЭлем.Значение));
	Если текСтроки.Количество()=0 тогда
		НовСтрока=ТаблицаСостав.Добавить();
		НовСтрока.Значение=текЭлем.Значение;
		НовСтрока.ГруппаОформления=текЭлем.Пометка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементСписка(текЭлем)
	текСтроки=ТаблицаСостав.НайтиСтроки(Новый Структура("Значение",текЭлем.Значение));
	НомСтроки=текСтроки.Количество();
	Пока НомСтроки>0 Цикл
		НомСтроки=НомСтроки-1;
		ТаблицаСостав.Удалить(ТаблицаСостав.Индекс(текСтроки[НомСтроки]));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ДобавляемыйСписок=СписокВыбранных(ВыбраннаяСтрока);
	Для Каждого текЭлем из ДобавляемыйСписок Цикл
		ДобавитьЭлементСписка(текЭлем);
	КонецЦикла;
	УстановитьОтбор(ПолучитьСписок());
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВыбранных(текСтрока)
	Результат=Новый СписокЗначений;
	Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	ГруппыДоступаОформления.Ссылка,
		             |	ГруппыДоступаОформления.ГруппаОформления
		             |ИЗ
		             |	Справочник.ГруппыДоступаОформления КАК ГруппыДоступаОформления
		             |ГДЕ
		             |	ГруппыДоступаОформления.Ссылка = &Ссылка
		             |	И ГруппыДоступаОформления.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка",текСтрока);
	текСписок=Запрос.Выполнить().Выбрать();
	Пока текСписок.Следующий() Цикл
		Результат.Добавить(текСписок.Ссылка,,текСписок.ГруппаОформления);
	КонецЦикла;
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ДобавитьВСписок(Команда)
	//Для каждого текСтрока из Элементы.ИсточникВыбора.ВыделенныеСтроки цикл
		текСтрока=Элементы.ИсточникВыбора.ТекущаяСтрока;
		ДобавляемыйСписок=СписокВыбранных(текСтрока);
		Для Каждого текЭлем из ДобавляемыйСписок Цикл
			ДобавитьЭлементСписка(текЭлем);
		КонецЦикла;
	//КонецЦикла;
	УстановитьОтбор(ПолучитьСписок());
КонецПроцедуры


&НаКлиенте
Процедура ФильтрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	УдаляемыйСписок=СписокВыбранных(Элемент.ТекущиеДанные.Значение);
	Для Каждого текЭлем из УдаляемыйСписок Цикл
		УдалитьЭлементСписка(текЭлем);
	КонецЦикла;
	УстановитьОтбор(ПолучитьСписок());
КонецПроцедуры


&НаКлиенте
Процедура УбратьИзСписка(Команда)
	//Для каждого текСтрока из Элементы.СписокСостав.ВыделенныеСтроки цикл
		текСтрока=Элементы.СписокСостав.ТекущиеДанные.Значение;
		УдаляемыйСписок=СписокВыбранных(текСтрока);
		Для Каждого текЭлем из УдаляемыйСписок Цикл
			УдалитьЭлементСписка(текЭлем);
		КонецЦикла;
	//КонецЦикла;
	УстановитьОтбор(ПолучитьСписок());
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	УправлениеДоступомОформлением.СохранитьГруппыДОПользователя(Объект.Пользователь,ПолучитьСписок());
	УправлениеДоступомОформлением.СохранитьНастройкиПользователя(Объект.Пользователь,ПолучитьНастройкиДляСохранения());
КонецПроцедуры

