
&НаКлиенте
Процедура СтатьиДвижения(Команда)
	ОткрытьФорму("Справочник.СтатьиДвижения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Подразделения(Команда)
	ОткрытьФорму("Справочник.Подразделения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Пользователи(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура БыстрыеКоманды(Команда)
	ОткрытьФорму("Справочник.Шаблоны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Константы(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатков(Команда)
	ОткрытьФорму("Обработка.ВводОстатков.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура РазделыОПиУ(Команда)
	ОткрытьФорму("Справочник.РазделыОПиУ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПомеченныхОбъектов(Команда)
	ОткрытьФорму("Обработка.УдалениеПомеченныхОбъектов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура РазделыБаланс(Команда)
	ОткрытьФорму("ПланСчетов.Внутренний.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГруппыДоступа(Команда)
	//ОткрытьФорму("Справочник.ГруппыДоступаОформления.ФормаСписка");
	ОткрытьФорму("ОбщаяФорма.УправлениеДоступом");
КонецПроцедуры

&НаКлиенте
Процедура ПервичнаяНастройка(Команда)
	ОткрытьФорму("Обработка.МастерНастройки.Форма",,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурсыВалют(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаКурсовВалютЦБ.Форма",,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВалюты(Команда)
	ОткрытьФорму("Справочник.Валюты.ФормаСписка");
КонецПроцедуры
