
&НаКлиенте
Процедура ВидСпискаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппыДО.Видимость=(ВидСписка=0);
	Элементы.ГруппыДоступа.Видимость=(ВидСписка=1);
	Элементы.ПрофилиГрупп.Видимость=(ВидСписка=2);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппы(Команда)
	текСтрока=Элементы.ГруппыДО.ТекущаяСтрока;
	ОткрытьФорму("Обработка.УстановитьСоставГруппыДО.Форма.Форма",Новый Структура("ГруппаДО",текСтрока),ЭтаФорма);
КонецПроцедуры
